УчетВУправляющихДляГит1/src/InformationRegisters/СтавкиНДСПоДоговорам/СтавкиНДСПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНДСПоДоговорам</name>
  <resources>
    <name>СпособЗаполненияСтавкиНДС</name>
    <type>
      <types>EnumRef.СпособыЗаполненияСтавкиНДС</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СтавкиНДСПоДоговорам/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Организация) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Организация = БухгалтерскийУчетПереопределяемый.ПолучитьОрганизациюПоДоговору(ЭтотОбъект[0].ДоговорКонтрагента);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Контрагент) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Контрагент = БухгалтерскийУчетПереопределяемый.ПолучитьКонтрагентаПоДоговору(ЭтотОбъект[0].ДоговорКонтрагента);
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
